import './FAQ.scss';

import Faq from 'react-faq-component';

import Container from '../../components/Container/Container';

const faqData = {
  rows: [
    {
      title: 'Як я можу зробити замовлення на Меблі Мрія?',
      content:
        'Зробити замовлення на Меблі Мрія легко. Просто перегляньте розділ “Магазин”, виберіть потрібні товари та додайте їх у свій кошик. Перейдіть на сторінку оформлення замовлення, введіть необхідну інформацію та завершіть процес оплати. Також оформити замовлення можна зателефонувавши або написавши на наші номери телефонів, вказані у контактній інформації сайту (знизу). Щойно ваше замовлення буде підтверджено, ми обробимо його та надамо вам оновлення щодо доставки.',
    },
    {
      title: 'Коли я отримаю своє замовлення?',
      content:
        'Якщо ви оформили замовлення до 16:00, воно буде оброблене та відправлене в той же день. В разі оформлення замовлення після 16:00 його відправка переноситься на наступний день.',
    },
    {
      title: 'Хто постачальник ваших меблів?',
      content:
        'Меблі Мрія представляє продукцію холдингу Black Red White. На території України холдинг представлений Фабрикою “Гербор”, Україна, м. Володимир-Волинський, і фабрикою “БРВ-Україна”, м. Нововолинськ. На підприємствах працюють понад 10 000 співробітників. Ці фабрики виготовляють широкий спектр корпусних меблів: віталень, дитячих меблів, меблів для спалень, передпокоїв, кухонь, офісів і кабінетів.',
    },
    {
      title: 'Яка ваша політика повернення?',
      content:
        'Повернення, обмін товару можливий за наступними умовами: протягом 14 днів без урахування дня купівлі товару, при отриманні, якщо є пошкодження упаковки, або пошкоджено окремі елементи виробу. Повернення бракованого товару відбувається шляхом заміни бракованих деталей. Зібраний виріб або зібрані частини виробу обміну та поверненню не підлягають! Обмін або повернення товару можливий за наявності: документу, що підтверджує придбання товару, повної комплектаціії товару, правильно оформленого оригіналу гарантійного талону, цілісної упаковки та цілісності фабричних етикеток та маркувань.',
    },
  ],
};

const FAQ = () => {
  return (
    <section className="faq sections__padding">
      <Container>
        <h2 className="faq__title">Найпоширеніші запитання</h2>
        <Faq data={faqData} />
      </Container>
    </section>
  );
};

export default FAQ;
